Can't create Baluster Patterns for Railings
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCreateBalusterPatterns { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCreateBalusterPatterns As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCreateBalusterPatterns {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace